Revit 2027 API
RebarBarType.SetHookOffsetLength Method
 Identifies the hook offset length for a hook type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetHookOffsetLength(
	ElementId hookId,
	double newLength
)
Public Sub SetHookOffsetLength (
	hookId As ElementId,
	newLength As Double
)
public:
void SetHookOffsetLength(
	ElementId^ hookId,
	double newLength
)
member SetHookOffsetLength :
        hookId : ElementId *
        newLength : float -> unit
Parameters
hookId ElementId
 id of the hook type
newLength Double
 The hook offset length for a hook type
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid -or- the hook specified by id hookId doesn't have valid offset length
ArgumentNullException |  A non-optional argument was null
Remarks
 AutoCalcHookLengths is ignored when this property is set
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace